//*============================================================================
//Actor.h
//*============================================================================
//[history]
//	08/03/06 修正開始
//[author]
//	Taka
//============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "selene.h"

//=============================================================================
//using
//=============================================================================
using namespace Selene;

//=============================================================================
//class
//=============================================================================
//[Desc]
//	モデルアクター用クラス
//=============================================================================
class CModelActor
{
	private:
	
		Scene::IModelActor *m_pModelActor;//モデルアクター

	public:
	
		//アクターの生成		
		void CreateActor( Scene::ISceneManager *pScene, Renderer::Object::IModel *pModel )
		{
			m_pModelActor = pScene->CreateActor( pModel );
		}
	
	public:
	
		//モデルアクターの取得	
		Scene::IModelActor *GetModelActor()
		{
			return m_pModelActor;
		}
		
		
};

//=============================================================================
//class
//=============================================================================
//[Desc]
//	モデルアクター
//=============================================================================
class CMapActor
{
	private:
	
		Scene::IMapActor *m_pMapActor;//マップアクター
		
	public:
	
		//アクターの生成	
		void CreateActor( Scene::ISceneManager *pScene, Renderer::Object::IMapModel *pMapModel )
		{
			m_pMapActor = pScene->CreateActor( pMapModel );
		}
		
	public:
		
		//マップアクターの取得	
		Scene::IMapActor *GetMapActor()
		{
			return m_pMapActor;
		}
		
	
};

