//*============================================================================
//BGM.h
//*============================================================================
//[history]
//	08/03/16　作成
//[author]
//	Taka
//============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "Sound.h"

//=============================================================================
//class
//=============================================================================
//[desc]
//	BGM再生用クラス
//=============================================================================
class CBGM :	public CSound
{
	private:
	
		Sound::IStreamSound *m_pBGM;//BGM再生用デバイス
	
	public:
	
		CBGM(void){};//コンストラクタ
		CBGM( string name );//コンストラクタ
		virtual ~CBGM(void);//デストラクタ
		
		virtual void LoadSound( ICore *pCore );//サウンドの読み込み
		
		void Init(){};//初期化
		void Exec();//処理
		
		void FadeOut();//フェードアウト
		
	/*Get系*/
	public:

		//効果音再生用デバイスの取得	
		Sound::IStreamSound *GetBGMDevice() const
		{
			return m_pBGM;
		}
		
};
