//*============================================================================
//CamObject.h
//*============================================================================
//[history]
//	08/03/14　作成
//[author]
//	Taka
//============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "character.h"
#include "camera.h"

//=============================================================================
//class
//=============================================================================
//[Desc]
//	カメラオブジェクト用クラス
//=============================================================================
class CCamObject :	public CCharacter
{
	private:
	
	public:
	
		CCamObject( string name );//コンストラクタ
	
		void Init();//初期化
		void Exec();//処理
		
	public:
	
		void Move( Selene::Peripheral::IInputController *pCtrl );//移動
		void Move( Selene::Peripheral::IJoystick *pJoy, CCamera *pCam );//移動
		void Move( Selene::Peripheral::IJoystick *pJoy );//移動
		void MoveExec( );
		void MoveAdjust( );//移動補正
		
		
};
