//*============================================================================
//Draw2DObject.h
//*============================================================================
//[history]
//	08/03/16 作成
//[author]
//	Taka
//============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "drawobject.h"

//=============================================================================
//class
//=============================================================================
//[Desc]
//	2D描画用オブジェクト
//=============================================================================
class Draw2DObject :	public CDrawObject
{
	private:
	
	protected:
	
		
	
	public:
	
		Draw2DObject(void){};//コンストラクタ
		Draw2DObject( string name );//コンストラクタ
		Draw2DObject( string name, Math::Vector2D vPos );//コンストラクタ
		~Draw2DObject(void);//デストラクタ
		
		virtual void Load( Renderer::IRender *pRender );//ファイル読み込み
		//void CreateActor( Scene::ISceneManager *pSceneMgr );//アクターの生成
		
		void Init(){};//初期化
		void Exec();//処理
		void Rendering();//レンダリング
		
		
};
