//*============================================================================
//EnemyManta.h
//*============================================================================
//[history]
//	08/05/31 作成
//[author]
//	Taka
//=============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "enemy.h"

//=============================================================================
//class
//=============================================================================
//[Desc]
//	マンタ用クラス
//=============================================================================
class CEnemyManta : public CEnemy
{
	private:
	
		bool m_IsLimitTime;//リミットタイムに達したかどうか
	
	public:
	
		CEnemyManta(){};//コンストラクタ
		CEnemyManta( string name, Math::Vector3D vPos, string filename );//コンストラクタ
		
		void Init();//初期化
		void Exec();//処理
		
		void MoveExec();//移動処理
		
	/*Set系*/
	public:
	
		/*リミットタイム判定フラグの設定*/
		void SetLimitFlag( bool flag )
		{
			m_IsLimitTime = flag;
		}
		
	public:
	
		/*リミットタイム判定フラグの取得*/
		bool GetLimitFlag( ) const
		{
			return m_IsLimitTime;
		}
		
};