//*============================================================================
//EnemyAmeus.h
//*============================================================================
//[history]
//	08/04/15 作成
//[author]
//	Taka
//=============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "enemy.h"

//=============================================================================
//enum
//=============================================================================
/*ヒットタイプ*/
enum eHitType
{
	HIT_PLAYER,
	HIT_MAP,	
	HIT_NONE,
};

//=============================================================================
//class
//=============================================================================
//[Desc]
//	アメウス用クラス
//=============================================================================
class CEnemyAmeus : public CEnemy
{
	private:
	
		bool m_IsHit;//プレイヤーに当たったか
		eHitType m_eHitType;//ヒットタイプ
		ICore *m_pCore;//コア
		
	
	public:
	
		CEnemyAmeus(){};//コンストラクタ
		CEnemyAmeus( string name, Math::Vector3D vPos, string filename );//コンストラクタ
		
		void Init();//初期化
		void Exec();//処理
		
		void MoveExec( );//移動
		
		static int SetAnimKey( lua_State *L );//アニメーションキーのセット
		
	public:
	
		/*ヒットタイプの設定*/
		void SetHitType( eHitType Type )
		{
			m_eHitType = Type;
		}
		
		/*プレイヤーに当たった判定フラグの設定*/
		void SetHitFlag( bool flag )
		{
			m_IsHit = flag;
		}
		
		void GetCore( ICore *pCore )
		{
			m_pCore = pCore;
		}
		
	public:
	
		/*判定フラグの取得*/
		bool GetHitFlag() const
		{
			return m_IsHit;
		}
		
};