//*============================================================================
//EnemyMouse.h
//*============================================================================
//[history]
//	08/04/15 作成
//[author]
//	Taka
//=============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "enemy.h"

//=============================================================================
//class
//=============================================================================
//[Desc]
//	ねずみ用クラス
//=============================================================================
class CEnemyMouse : public CEnemy
{
	private:
	
	public:
	
		CEnemyMouse(){};//コンストラクタ
		CEnemyMouse( string name, Math::Vector3D vPos, string filename );//コンストラクタ
		
		void Init();//初期化
		void Exec();//処理
		void Rendering( int index );//レンダリング
		
		void MoveExec();//移動処理
		void MovePatternStand();//立ち状態の移動パターン
		void PlaySnd( Sound::ISound *pSound, float fDistance );//効果音の再生
};