//*============================================================================
//EnemyBird.h
//*============================================================================
//[history]
//	08/04/15 作成
//[author]
//	Taka
//=============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "enemy.h"

//=============================================================================
//class
//=============================================================================
//[Desc]
//	鳥用クラス
//=============================================================================
class CEnemyBird : public CEnemy
{
	private:
	
		bool m_IsFly;//飛んでいる状態かどうか
	
	public:
	
		CEnemyBird(){};//コンストラクタ
		CEnemyBird( string name, Math::Vector3D vPos, string filename );//コンストラクタ
		
		void Init();//初期化
		void Exec();//処理
		
		void MoveExec();//移動処理
		void Rendering( int index );//レンダリング
		
		void MovePatternFly();//飛行用
		void PlaySnd( Sound::ISound *pSound, float fDistance );//効果音の再生
		
};