//*============================================================================
//GameSceneManager.h
//*============================================================================
//[history]
//	08/03/05　作成
//[author]
//	Taka
//============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "gameobject.h"
#include "player.h"
#include "Scene.h"
#include "Game.h"
#include "Fiber.h"


//=============================================================================
//struct
//=============================================================================
struct SceneList
{
	eSceneType m_eSceneType;//シーンタイプ
	CScene *m_pScene;//シーン
};

//=============================================================================
//using
//=============================================================================
using namespace std;

//=============================================================================
//class
//=============================================================================
//[Desc]
//	ゲームシーン管理用クラス
//=============================================================================
class CGameSceneManager
{
	private:
	
		list<SceneList> m_SceneList;//シーンリスト
		CScene *m_pScene;//シーン
		Fiber::IFiberController *m_pFiberCtrl;//ファイバーコントロール
		
	
	private:
	
	public:
	
		CGameSceneManager( CScene *pScene );//コンストラクタ
		~CGameSceneManager();//デストラクタ
		
		void Exec();//処理
		
		void AddScene( eSceneType Type, CScene *pScene );//シーンの追加
		void RemoveScene( CScene *pScene );//シーンの削除
		
		CScene *FindScene( eSceneType Type );//シーンの参照
		
	public:
	
		//void GetGameScene( CScene *pScene );//ゲームシーンの取得
		
};