//*============================================================================
//SceneFade.h
//*============================================================================
//[history]
//	08/04/10 作成
//[author]
//	Taka
//============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "scene.h"

//=============================================================================
//enum
//=============================================================================
//フェード用
enum eSceneEffect
{
	FADE_IN,
	FADE_OUT,
};

//=============================================================================
//class
//=============================================================================
//[Desc]
//	シーンエフェクト用クラス
//=============================================================================
class CSceneEffect :	public CScene
{
	private:
	
		eSceneEffect m_eEffect;//シーンエフェクト
		int m_FadeTime;//フェード時間
			 
	public:
	
		CSceneEffect( eSceneEffect eEffect, int count );//コンストラクタ
		virtual ~CSceneEffect(void);//デストラクタ
		
	public:
		
		void Exec( CScene *pScene );//処理
	
	public:
	
		void SetEffect( eSceneEffect eEffect );//エフェクトの設定
		void FadeOut( CScene *pScene );//フェードアウト
		void FadeIn( CScene *pScene );//フェードイン
		void Wipe( CScene *pScene );//ワイプ
};
